# Pandas (pannal data analysis)
it's used for data manipulation and data analysis.
- primary data analysis library in python.
- pandas library provides a number of data analysis features, which made if one of the most popular data science tool
- pandas has two data structure first one is Series and second one is Dataframe

In [14]:
import pandas as pd

In [15]:
p = pd.Series(['waqas','hammad','zohaib'] , [1,2,3])

In [16]:
p

1     waqas
2    hammad
3    zohaib
dtype: object

In [17]:
import pandas as pd
d = {'first': pd.Series([500,600,700,800], index=['a','b','c','d']),
     'second': pd.Series([1600,1700,1800,1900], index=['a','b','c','d'])}

In [18]:
df = pd.DataFrame(d)

In [19]:
df

   first  second
a    500    1600
b    600    1700
c    700    1800
d    800    1900

In [20]:
sales_team = {'First_month': pd.Series([30,28,50,29,40,50], index=['Waqas',"Ribal",'Shumaim','Bilal','Hassan','Ahsan']),
              'Second_month' : pd.Series([34,32,54,31,43,56], index=['Waqas',"Ribal",'Shumaim','Bilal','Hassan','Ahsan']),
              'Third_month' : pd.Series([36,38,44,21,48,26], index=['Waqas',"Ribal",'Shumaim','Bilal','Hassan','Ahsan']),
              'Forth_month' : pd.Series([38,12,24,11,23,36], index=['Waqas',"Ribal",'Shumaim','Bilal','Hassan','Ahsan'])}
pd.DataFrame(sales_team)

         First_month  Second_month  Third_month  Forth_month
Waqas             30            34           36           38
Ribal             28            32           38           12
Shumaim           50            54           44           24
Bilal             29            31           21           11
Hassan            40            43           48           23
Ahsan             50            56           26           36

In [21]:
sales_team['Third_month']

Waqas      36
Ribal      38
Shumaim    44
Bilal      21
Hassan     48
Ahsan      26
dtype: int64

In [22]:
# add first column into second column
sales_team["Fifth_month"]= sales_team['First_month'] + sales_team['Second_month']
pd.DataFrame(sales_team)

         First_month  Second_month  Third_month  Forth_month  Fifth_month
Waqas             30            34           36           38           64
Ribal             28            32           38           12           60
Shumaim           50            54           44           24          104
Bilal             29            31           21           11           60
Hassan            40            43           48           23           83
Ahsan             50            56           26           36          106

In [25]:
sales_team['min/max'] = sales_team['Fifth_month'] < 100
pd.DataFrame(sales_team)

,First_month,Second_month,Third_month,Forth_month,Fifth_month,min/max
Waqas,30,34,36,38,64,True
Ribal,28,32,38,12,60,True
Shumaim,50,54,44,24,104,False
Bilal,29,31,21,11,60,True
Hassan,40,43,48,23,83,True
Ahsan,50,56,26,36,106,False